#define  _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
int main()
{
	
		/*5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
		A选手说：B第二，我第三；
		B选手说：我第二，E第四；
		C选手说：我第一，D第二；
		D选手说：C最后，我第三；
		E选手说：我第四，A第一；
		比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。*/
	//1.首先吧abcde所有的可能都排列下来
	//2.在所有的排序中找到满足abcde的条件的排序
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	//a b c d e的所有排序
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						//满足a的条件:A选手说：B第二，我第三；
						if ((b == 2 && a != 3)||(b != 2 && a == 3))
						{
							//满足b的条件：B选手说：我第二，E第四；
							if ((b == 2 && e != 4) || (b != 2 && e == 4))
							{
								//满足c的条件：C选手说：我第一，D第二；
								if ((c == 1 && d != 2) || (c != 1 && d == 2))
								{
									//满足d的条件：D选手说：C最后，我第三；
									if ((c == 5 && d != 3) || (c != 5 && d == 3))
									{
										//满足e的条件：E选手说：我第四，A第一；
										if ((e == 4 && a != 1) || (e != 4 && a == 1))
										{
											//满足了以上的条件之后，还有隐藏的条件，a b c d e的名次不能一样
											if (a != b && a != c && a != d && a != e
												 && b != c && b != d && b != e
												 && c != d && c != e
												 && d != e)
											{
												printf("a = %d, b = %d, c = %d, d = %d, e = %d\n", a, b, c, d, e);
											}
										}
									}

								}


							}
						}
					}
				}
			}
		}
	}
	system("pause");	
	return 0;
}